src/cf/InformationRegisters/Б24_ИдентификаторыОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>Б24_ИдентификаторыОбъектов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДополнительныйИдентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Портал</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипДанных</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Б24_ТипыДанныхДляОбменаСПорталом</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Б24_ОбъектыВыгрузки</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПодчиненныйОбъект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/Б24_ИдентификаторыОбъектов/Forms/ФормаЗаписи/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Выборка = Справочники.Б24_НастройкиСинхронизацииСБитрикс24.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если НЕ ЗначениеЗаполнено(Выборка.Портал) тогда
			Продолжить;
		КонецЕсли;
		
		Если Элементы.Портал.СписокВыбора.НайтиПоЗначению(Выборка.Портал) = Неопределено тогда
			Элементы.Портал.СписокВыбора.Добавить(Выборка.Портал);
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
		
	ТипыДанныхДляОбменаСПорталом = Б24_СинхронизацияПовтИсп.ПолучитьТипыДанныхДляОбменаСПорталом();
	
	Если Запись.ТипДанных = ТипыДанныхДляОбменаСПорталом.ГруппаТовара тогда
		Элементы.Объект.ВыборГруппИЭлементов = ГруппыИЭлементы.Группы;
	Иначе
		Элементы.Объект.ВыборГруппИЭлементов = ГруппыИЭлементы.Элементы;
	КонецЕсли;

	Если Запись.ТипДанных = ТипыДанныхДляОбменаСПорталом.СвойствоЗаказа тогда
		Элементы.КомандаЗагрузитьИдПлательщиков.Видимость 	= Истина;
		Элементы.ПодчиненныйОбъект.КнопкаВыбора 			= Ложь;	
	Иначе
		Элементы.КомандаЗагрузитьИдПлательщиков.Видимость 	= Ложь;
		Элементы.ПодчиненныйОбъект.КнопкаВыпадающегоСписка 	= Ложь;	
		Элементы.ПодчиненныйОбъект.КнопкаВыбора 			= Истина;	
	КонецЕсли;
		
КонецПроцедуры


&НаКлиенте
Процедура КомандаЗагрузитьИдПлательщиков(Команда)
	
	КоличествоНастроек = Б24_СинхронизацияВызовСервера.ПолучитьКоличествоНастроекСинхронизации();
	
	Если КоличествоНастроек > 1 тогда
		
		ВыбЗнач 	= Неопределено;
		
		Массив 		= Новый Массив;
		Массив.Добавить(Тип("СправочникСсылка.Б24_НастройкиСинхронизацииСБитрикс24"));
		ОписаниеТипов = Новый ОписаниеТипов(Массив);
		
		Оповещение = Новый ОписаниеОповещения("ПослеВводаЗначения", ЭтотОбъект);

		ПоказатьВводЗначения(Оповещение, ВыбЗнач, "Укажите настройку синхронизации", ОписаниеТипов);	
		
	Иначе
		Параметры = Новый Структура;	
		ПослеВводаЗначения(Б24_СинхронизацияВызовСервера.ПолучитьНастройкуСинхронизацииПоУмолчанию(), Параметры);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаЗначения(ВыбЗнач, Параметры) Экспорт
	
	Если ЗначениеЗаполнено(ВыбЗнач) Тогда

		НастройкаСинхронизации = ВыбЗнач; 

		Элементы.ПодчиненныйОбъект.СписокВыбора.Очистить();
		
		ОбщиеНастройки =  Б24_СинхронизацияКлиентСервер.СформироватьБазовуюСтруктуруНастроек(НастройкаСинхронизации);  
		
		Если ОбщиеНастройки = Неопределено тогда
			ПоказатьПредупреждение(, "Не удалось подключиться к Битрикс24");
			Возврат;
		КонецЕсли;
			
		ОбщиеНастройки.Измерение2 = "Получение плательщиков заказов";	
		
		Метод = "/rest/sale.persontype.list";
		
		Фильтр = "&filter[>ID]=0";
		
		СтруктураОтвета = Б24_RestApiВызовСервера.ОтправкаДанныхНаПортал(ОбщиеНастройки, Метод, Фильтр); 
		
		Если СтруктураОтвета = Неопределено тогда
			Возврат;
		КонецЕсли;
		
		Если СтруктураОтвета.Получить("result") <> неопределено тогда
			
			Для каждого ТекЭлемент из СтруктураОтвета.Получить("result") Цикл
				
				Если ТекЭлемент.Получить("active") <> "Y" тогда
					Продолжить;
				КонецЕсли;
				
				Элементы.ПодчиненныйОбъект.СписокВыбора.Добавить(Формат(ТекЭлемент.Получить("id"), "ЧГ=0"), ТекЭлемент.Получить("name"));
				
			КонецЦикла;
		
		КонецЕсли;
		
		Следующие = СтруктураОтвета.Получить("next"); 
		
		Пока ЗначениеЗаполнено(Следующие) Цикл
			
			Следующие = Формат(Следующие, "ЧГ=0");

			ТелоHTTPЗапроса = "&start="+Следующие + Фильтр;	
			
			СтруктураОтвета = Б24_RestApiВызовСервера.ОтправкаДанныхНаПортал(ОбщиеНастройки, Метод, ТелоHTTPЗапроса); 
			
			Если СтруктураОтвета = Неопределено тогда
				Прервать;
			КонецЕсли;
			
			Если СтруктураОтвета.Получить("result") <> Неопределено тогда
				
				Для каждого ТекЭлемент из СтруктураОтвета.Получить("result") Цикл
					
					Если ТекЭлемент.Получить("active") <> Истина тогда
						Продолжить;
					КонецЕсли;
					
					Элементы.ПодчиненныйОбъект.СписокВыбора.Добавить(Формат(ТекЭлемент.Получить("id"), "ЧГ=0"), ТекЭлемент.Получить("name"));
					
				КонецЦикла;
			КонецЕсли;
			
		   Следующие = СтруктураОтвета.Получить("next");
		   
		КонецЦикла;
		
	КонецЕсли;
	
	Элементы.ПодчиненныйОбъект.КнопкаВыпадающегоСписка = Истина;	
	
КонецПроцедуры


&НаКлиенте
Процедура ТипДанныхПриИзменении(Элемент)
	
	ТипыДанныхДляОбменаСПорталом = Б24_СинхронизацияПовтИсп.ПолучитьТипыДанныхДляОбменаСПорталом();
	
	Если Запись.ТипДанных = ТипыДанныхДляОбменаСПорталом.ГруппаТовара тогда
		Элементы.Объект.ВыборГруппИЭлементов = ГруппыИЭлементы.Группы;
	Иначе
		Элементы.Объект.ВыборГруппИЭлементов = ГруппыИЭлементы.Элементы;
	КонецЕсли;

	Если Запись.ТипДанных = ТипыДанныхДляОбменаСПорталом.СвойствоЗаказа тогда
		Элементы.КомандаЗагрузитьИдПлательщиков.Видимость 	= Истина;
		Элементы.ПодчиненныйОбъект.КнопкаВыбора 			= Ложь;	
	Иначе
		Элементы.КомандаЗагрузитьИдПлательщиков.Видимость 	= Ложь;
		Элементы.ПодчиненныйОбъект.КнопкаВыпадающегоСписка 	= Ложь;	
		Элементы.ПодчиненныйОбъект.КнопкаВыбора 			= Истина;	
	КонецЕсли;
		
КонецПроцедуры
